#include "funct.h"
#include "d3d9_x.h"
#include <dwmapi.h>
#include <vector>
#include "skStr.h"
#include <Windows.h>
#include <iostream>
#include <vector>
#include <fstream>
#include "D3DX/d3dx9math.h"
#include <thread>
#include <Windows.h>
#include <direct.h>
#include <string>
#include "skStr.h"
#include "Driver.h"
#include "settings.h"
#include <intrin.h>
#include <list>
#include "lib.hpp"
#include "globals.h"
#include "icons.h"
#include "font.h"
#include "utils.h"

#define MENU_TAB_DEFAULT 0
#define MENU_TAB_ASSULTRIFLE 1
#define MENU_TAB_SHOTGUN 2
#define MENU_TAB_SMG 3
#define MENU_TAB_PISTOL 4
#define MENU_TAB_SNIPER 5


RECT GameRect = { NULL };
D3DPRESENT_PARAMETERS d3dpp;
ImFont* fn = nullptr;
ImFont* gta = nullptr;
ImFont* SkeetFont = nullptr;
ImFont* DefaultFont = nullptr;

MSG Message = { NULL };
const MARGINS Margin = { -1 };
HWND game_wnd;
int screen_width;
bool streamproof;
int screen_height;
static void xCreateWindow();
static void xInitD3d();
static void xMainLoop();                     
static void xShutdown();
static LRESULT CALLBACK WinProc(HWND hWnd, UINT Message, WPARAM wParam, LPARAM lParam);
extern LRESULT ImGui_ImplWin32_WndProcHandler(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam);

static HWND Window = NULL;
IDirect3D9Ex* p_Object = NULL;                         
static LPDIRECT3DDEVICE9 D3dDevice = NULL;
static LPDIRECT3DVERTEXBUFFER9 TriBuf = NULL;

int center_x = GetSystemMetrics(0) / 2 - 3;
int center_y = GetSystemMetrics(1) / 2 - 3;

DWORD UDPID;

int AimFOV = 180;


namespace settings
{
	DWORD_PTR Uworld;
	DWORD_PTR LocalPawn;
	DWORD_PTR PlayerState;
	DWORD_PTR Localplayer;
	DWORD_PTR Rootcomp;
	DWORD_PTR PlayerController;
	DWORD_PTR Persistentlevel;
	DWORD_PTR Gameinstance;
	DWORD_PTR LocalPlayers;
	uint64_t PlayerCameraManager;
	uint64_t WorldSettings;
	Vector3 localactorpos;
	Vector3 relativelocation;
	DWORD_PTR AActors;
	DWORD ActorCount;
}

//STRUCTURES
typedef struct _TT {
	uint64_t Actor;
	int ID;
	uint64_t mesh;
	uint64_t root;
	uint64_t PlayerState;
	uint64_t LocalPlayerState;
	uint32_t LocalTeamID;
	uint32_t TeamID69;
	Vector3 pos;
	std::string name;
	bool Spotted;
}TT;

typedef struct _FNlEntity {
	uint64_t Actor;
	uint64_t mesh;
	int id;
}FNlEntity;

struct FVector {
	double X; // 0x00(0x08)
	double Y; // 0x08(0x08)
	double Z; // 0x10(0x08)
};

// Size: 0x18 (Inherited: 0x00)
struct FRotator {
	double Pitch; // 0x00(0x08)
	double Yaw; // 0x08(0x08)
	double Roll; // 0x10(0x08)
};

// Size: 0x770 (Inherited: 0x00)
struct FMinimalViewInfo {
	struct Vector3 Location; // 0x00(0x18)
	struct Vector3 Rotation; // 0x18(0x18)
	float FOV; // 0x30(0x04)
	float DesiredFOV; // 0x34(0x04)
	float OrthoWidth; // 0x38(0x04)
	float OrthoNearClipPlane; // 0x3c(0x04)
	float OrthoFarClipPlane; // 0x40(0x04)
	float AspectRatio; // 0x44(0x04)
	char bConstrainAspectRatio : 1; // 0x48(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x48(0x01)
	char pad_48_2 : 6; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	char pad_4D[0x3]; // 0x4d(0x03)
	float PostProcessBlendWeight; // 0x50(0x04)
	char pad_54[0xc]; // 0x54(0x0c)
	char pad_700[0x70]; // 0x700(0x70)
};

// ScriptStruct FortniteGame.FortPlayerAttributeSets
// Size: 0x50 (Inherited: 0x00)
struct FFortPlayerAttributeSets {
	struct UFortRegenHealthSet* HealthSet; // 0x00(0x08)
	struct UFortControlResistanceSet* ControlResistanceSet; // 0x08(0x08)
	struct UFortDamageSet* DamageSet; // 0x10(0x08)
	struct UFortMovementSet* MovementSet; // 0x18(0x08)
	struct UFortAdvancedMovementSet* AdvancedMovementSet; // 0x20(0x08)
	struct UFortConstructionSet* ConstructionSet; // 0x28(0x08)
	struct UFortPlayerAttrSet* PlayerAttrSet; // 0x30(0x08)
	struct UFortCharacterAttrSet* CharacterAttrSet; // 0x38(0x08)
	struct UFortWeaponAttrSet* WeaponAttrSet; // 0x40(0x08)
	struct UFortHomebaseSet* HomebaseSet; // 0x48(0x08)
};

typedef struct _LootEntity {
	std::string GNames;
	uintptr_t ACurrentItem;
}LootEntity;

// ScriptStruct FortniteGame.FortPlayerPawnStats
// Size: 0xd8 (Inherited: 0xc0)
struct FFortPlayerPawnStats {
	float MaxJumpTime; // 0xc0(0x04)
	float MaxStamina; // 0xc4(0x04)
	float StaminaRegenRate; // 0xc8(0x04)
	float StaminaRegenDelay; // 0xcc(0x04)
	float SprintingStaminaExpenditureRate; // 0xd0(0x04)
};

struct Camera
{
	Vector3 Location;
	Vector3 Rotation;
	float FieldOfView;
}; Camera vCamera;

// ScriptStruct Engine.TViewTarget
// Size: 0x790 (Inherited: 0x00)
struct FTViewTarget {
	struct FMinimalViewInfo POV; // 0x10(0x770)
};

FRotator* Rotator(FQuat* Current, struct FRotator* retstr)
{
	float Z; // xmm4_4
	float Y; // xmm0_4
	float W; // xmm2_4
	float v7; // xmm5_4
	float v8; // xmm7_4
	float v9; // xmm8_4
	float v10; // xmm0_4
	float v11; // xmm1_4
	float v12; // xmm7_4
	float X; // xmm0_4
	float v14; // xmm0_4
	float v15; // xmm0_4
	float v16; // xmm0_4
	float v17; // xmm1_4
	float v18; // xmm5_4
	float v19; // xmm2_4
	float v20; // xmm4_4
	float v21; // xmm0_4
	float v22; // xmm0_4
	float v23; // xmm2_4
	float v24; // xmm4_4

	Z = Current->z;
	Y = Current->y;
	W = Current->w;
	v7 = (float)(Current->x * Z) - (float)(Y * W);
	v8 = (float)((float)(Y * Current->x) + (float)(Y * Current->x)) + (float)((float)(W * Z) + (float)(W * Z));
	v9 = 1.0 - (float)((float)((float)(Y * Y) + (float)(Y * Y)) + (float)((float)(Z * Z) + (float)(Z * Z)));
	if (v7 >= -0.49999949)
	{
		if (v7 <= 0.49999949)
		{
			v18 = v7 + v7;
			v19 = v18;
			v20 = sqrtf(fmaxf(1.0 - v19, 0.0))
				* (float)((float)((float)((float)((float)((float)((float)((float)((float)((float)((float)((float)((float)(0.0066700899 - (float)(v19 * 0.0012624911)) * v19)
					- 0.017088126)
					* v19)
					+ 0.03089188)
					* v19)
					- 0.050174303)
					* v19)
					+ 0.088978991)
					* v19)
					- 0.2145988)
					* v19)
					+ 1.5707963);
			if (v18 < 0.0)
				v21 = v20 - 1.5707963;
			else
				v21 = 1.5707963 - v20;
			retstr->Pitch = v21 * 57.295776;
			v22 = atan2(v8, v9);
			v23 = Current->x * Current->x;
			v24 = Current->x * Current->w;
			retstr->Yaw = v22 * 57.295776;
			v15 = atan2(
				(float)((float)(Current->y * Current->z) * -2.0) - (float)(v24 + v24),
				1.0 - (float)((float)(v23 + v23) + (float)((float)(Current->y * Current->y) + (float)(Current->y * Current->y))))
				* 57.295776;
			goto LABEL_13;
		}
		retstr->Pitch = 90.0;
		v16 = atan2(v8, v9);
		v17 = Current->w;
		retstr->Yaw = v16 * 57.295776;
		v14 = retstr->Yaw - (float)((float)(atan2(Current->x, v17) * 2.0) * 57.295776);
	}
	else
	{
		retstr->Pitch = -90.0;
		v10 = atan2(v8, v9);
		v11 = Current->w;
		v12 = v10 * 57.295776;
		X = Current->x;
		retstr->Yaw = v12;
		//v14 = COERCE_FLOAT(LODWORD(v12) ^ _xmm) - (float)((float)(FGenericPlatformMath::Atan2(X, v11) * 2.0) * 57.295776);
	}
LABEL_13:
	retstr->Roll = 0;
	return retstr;
}

struct FFortGameplayAttributeData {
	float Minimum; // 0x10(0x04)
	float Maximum; // 0x14(0x04)
	bool bIsCurrentClamped; // 0x18(0x01)
	bool bIsBaseClamped; // 0x19(0x01)
	bool bShouldClampBase; // 0x1a(0x01)
	char pad_1B[0x1]; // 0x1b(0x01)
	float UnclampedBaseValue; // 0x1c(0x04)
	float UnclampedCurrentValue; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// Class FortniteGame.AthenaBigBaseWall
// Size: 0xa58 (Inherited: 0x9c8)
struct AAthenaBigBaseWall{
	float WallGravity; // 0x9c8(0x04)
	float TimeUntilWallComesDown; // 0x9cc(0x04)
	bool bResetBool; // 0x9d0(0x01)
	//enum class EBarrierState BarrierState; // 0x9d1(0x01)
	char pad_9D2[0x6]; // 0x9d2(0x06)
	//struct FScalableFloat ZKillLevel; // 0x9d8(0x28)
	char pad_A00[0x58]; // 0xa00(0x58)

	void WallStartingToComeDown(bool bIsOnBurgerSide); // Function FortniteGame.AthenaBigBaseWall.WallStartingToComeDown // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void UpdateWallTime(float, float, float, float); // Function FortniteGame.AthenaBigBaseWall.UpdateWallTime // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void ShowOrHideTimer(bool bNewVisibleState); // Function FortniteGame.AthenaBigBaseWall.ShowOrHideTimer // (Event|Protected|BlueprintEvent) // @ game+0x1036c24
	void OnRep_WallGravity(); // Function FortniteGame.AthenaBigBaseWall.OnRep_WallGravity // (Final|Native|Protected) // @ game+0x78b3450
	void OnRep_TimeUntilWallComesDown(); // Function FortniteGame.AthenaBigBaseWall.OnRep_TimeUntilWallComesDown // (Final|Native|Protected) // @ game+0x78b32cc
	void OnRep_ResetBool(); // Function FortniteGame.AthenaBigBaseWall.OnRep_ResetBool // (Final|Native|Protected) // @ game+0x24b6bc4
